uhnp/src/InformationRegisters/ОтложеннаяОбработкаЭтаповПроцессов/ОтложеннаяОбработкаЭтаповПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтложеннаяОбработкаЭтаповПроцессов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ВремяСобытия</name>
    <comment>Количество часов до возникновения события</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КлючевойОбъект</name>
    <type>
      <types>DefinedType.ОбъектыДляСогласования</types>
    </type>
  </resources>
  <attributes>
    <name>ВремяНачалаЗадания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗавершенияЗадания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстКомментария</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВидДействия</name>
    <type>
      <types>EnumRef.СобытияОтложеннойОбработкиПроцессов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПроцесса</name>
    <type>
      <types>DocumentRef.ЭкземплярПроцесса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтапПроцесса</name>
    <type>
      <types>CatalogRef.ЭтапыУниверсальныхПроцессов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипКлючевогоОбъекта</name>
    <type>
      <types>CatalogRef.ДокументыБД</types>
      <types>CatalogRef.СправочникиБД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Выполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.Задачи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ТипыЭтаповУниверсальныхПроцессов/ТипыЭтаповУниверсальныхПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЭтаповУниверсальныхПроцессов</name>
  <enumValues>
    <name>ЭтапСогласования</name>
  </enumValues>
  <enumValues>
    <name>ЭтапПроцессаПодготовкиОтчетности</name>
  </enumValues>
  <enumValues>
    <name>УсловныйПереход</name>
  </enumValues>
  <enumValues>
    <name>Автоутверждение</name>
  </enumValues>
  <enumValues>
    <name>Автоотклонение</name>
  </enumValues>
  <enumValues>
    <name>ДочернийМаршрут</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаУниверсальногоПроцесса</name>
  </enumValues>
  <enumValues>
    <name>Оповещение</name>
  </enumValues>
  <enumValues>
    <name>ЦиклПока</name>
  </enumValues>
  <enumValues>
    <name>ЭтапУниверсальногоИмпорта</name>
  </enumValues>
  <enumValues>
    <name>ЭтапУниверсальногоЭкспорта</name>
  </enumValues>
  <enumValues>
    <name>Пауза</name>
  </enumValues>
  <enumValues>
    <name>РучнойПереход</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыОповещенийПользователейУХ/ВидыОповещенийПользователейУХ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОповещенийПользователейУХ</name>
  <enumValues>
    <name>ИзменениеСостоянияЭкземпляраОтчета</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеДокументаНаСогласованиеПоМаршруту</name>
  </enumValues>
  <enumValues>
    <name>ОткрытиеПериода</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеПериода</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеИнформацииПоДокументу</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеЭкземпляраОтчетаНаЕдиноличноеСогласование</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеОтчетаНаСогласование</name>
  </enumValues>
  <enumValues>
    <name>ДобавлениеСогласующего</name>
  </enumValues>
  <enumValues>
    <name>УдалениеСогласующего</name>
  </enumValues>
  <enumValues>
    <name>ОтклонениеОтчета</name>
  </enumValues>
  <enumValues>
    <name>УтверждениеОтчета</name>
  </enumValues>
  <enumValues>
    <name>ЗапросИнформацииПоДокументу</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросИнформацииПоДокументу</name>
  </enumValues>
  <enumValues>
    <name>НапоминаниеОНеобходимостиСогласования</name>
  </enumValues>
  <enumValues>
    <name>ДокументСогласован</name>
  </enumValues>
  <enumValues>
    <name>Ознакомление</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольноеУведомление</name>
  </enumValues>
  <enumValues>
    <name>ЭтапСогласован</name>
  </enumValues>
  <enumValues>
    <name>ЭтапОтклонен</name>
  </enumValues>
  <enumValues>
    <name>ПроцессЗапущен</name>
  </enumValues>
  <enumValues>
    <name>ПроцессОстановлен</name>
  </enumValues>
  <enumValues>
    <name>ДобавленДополнительныйСогласующий</name>
    <comment>В этап согласования был добавлен дополнительный согласующий</comment>
  </enumValues>
  <enumValues>
    <name>УдаленДополнительныйСогласующий</name>
    <comment>Из этапа согласования был удален дополнительный согласующий</comment>
  </enumValues>
  <enumValues>
    <name>ВыбранСледующийЭтап</name>
  </enumValues>
  <enumValues>
    <name>ЭтапПринятКИсполнению</name>
  </enumValues>
  <enumValues>
    <name>ОтмененоПринятиеЭтапаКИсполнению</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЭтапПринятКИсполнению</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОтмененоПринятиеЭтапаКИсполнению</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочийКаталог</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещатьПоEmail</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьНапоминания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКомпактныйИнтерфейс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещатьЧерезСистемуВзаимодействия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещатьЧерезТелеграм</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/CommonForms/КомментарийИСогласование/Module.bsl
#Область ОписаниеПеременных

Перем ТекущийЭтап;
Перем КэшСогласованияЭтапа;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Параметр формы РежимОткрытия.
	Если Параметры.Свойство("РежимСогласования") Тогда
		РежимСогласования = Параметры.РежимСогласования;
	Иначе
		РежимСогласования = "";
	КонецЕсли;
	// Параметр формы ДопСогласование.
	Если Параметры.Свойство("ДопСогласование") Тогда
		ДопСогласование = Параметры.ДопСогласование;
	Иначе
		ДопСогласование = Ложь;
	КонецЕсли;
	// Параметр СписокЗадач.
	Если Параметры.Свойство("СписокЗадач") Тогда
		СписокЗадач = Параметры.СписокЗадач;
	Иначе
		СписокЗадач = Новый СписокЗначений;
	КонецЕсли;
	// Параметр АдресТаблицыЗадач.
	АдресТаблицыЗадач = Параметры.АдресТаблицыЗадач;
	
	СогласовываемыйДокумент = Параметры.СогласовываемыйДокумент;
	ПакетДокументов = ?(НЕ Параметры.Свойство("ПакетДокументов"),Неопределено,Параметры.ПакетДокументов);
	Элементы.ДобавитьСогласующих.Пометка=Ложь;
	Элементы.ГруппаСогласующие.Видимость=Элементы.ДобавитьСогласующих.Пометка;
	ТекПользователь = ОбщегоНазначенияУХ.ПолучитьЗначениеПеременной("глТекущийПользователь");
	
	Элементы.СогласовываемыйДокумент.Видимость = ЗначениеЗаполнено(СогласовываемыйДокумент);
	Если СогласовываемыйДокумент = Неопределено И (ПакетДокументов = Неопределено ИЛИ НЕ ПакетДокументов.Количество()) = Неопределено Тогда
		Отказ = истина;
		Возврат;
	КонецЕсли;
	ЕстьСогласовываемыйДокумент = (СогласовываемыйДокумент <> Неопределено);
	Если ЕстьСогласовываемыйДокумент Тогда	
		
		ТаблицаЭтаповПользователя = МодульУправленияПроцессамиУХ.ЭтапыСогласованияДляТекущегоПользователя(СогласовываемыйДокумент, СписокЗадач);
		
		ЗначениеВРеквизитФормы(ТаблицаЭтаповПользователя, "ТекущиеЭтапыСогласования");
		
		ОрганизацияОбъекта = МодульУправленияПроцессамиУХ.ПолучитьОрганизациюОбъекта(Параметры.СогласовываемыйДокумент);
		ЕстьСуперПользовательПоОрганизации = МодульСогласованияДокументовУХ.ЕстьСуперПользователь(ОрганизацияОбъекта);
		
		Если ТекущиеЭтапыСогласования.Количество() = 0 И НЕ ЕстьСуперПользовательПоОрганизации Тогда
			
			ТекущийСогласующий =  МодульУправленияПроцессамиУХ.ПолучитьОтветственногоЗаТипОбъекта(СогласовываемыйДокумент,,,,"Согласующий");
			
			Если НЕ ЗначениеЗаполнено(ТекущийСогласующий) Тогда
				Отказ  = Истина;
				Сообщение = Новый СообщениеПользователю;
				ТекстСообщения = НСтр("ru = 'Для объекта %Документ% ответственный за согласование в матрице полномочий не задан. Установите нужный статус согласования вручную'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", Строка(СогласовываемыйДокумент));
				Сообщение.Текст = ТекстСообщения;
				Сообщение.Сообщить();	
				Возврат;	
			КонецЕсли;
			
			
			Если НЕ МодульУправленияПроцессамиУХ.ПроверитьПроцессИнициализирован(СогласовываемыйДокумент,Неопределено,,ТекущийСогласующий) Тогда
				Отказ  = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ru = 'Процесс согласования не запущен. Необходимо отправить объект на согласование'");
				Сообщение.Сообщить();	
				Возврат;
			КонецЕсли;
			
			Отказ  = Истина;
			Сообщение = Новый СообщениеПользователю;
			
			ТаблицаОтветственныхПользователей = МодульУправленияПроцессамиУХ.ОтветственныеПользователиПоОбъектуСогласования(СогласовываемыйДокумент, СписокЗадач);	
			ТаблицаОтветственныхПользователей.Свернуть("Пользователь, ПринялКИсполнению");
			МассивПринялКИсполнению = ТаблицаОтветственныхПользователей.ВыгрузитьКолонку("ПринялКИсполнению");
			
			Уточнение = "";
			Если МассивПринялКИсполнению.Количество() > 0 Тогда
				Сообщение.Текст = СтрШаблон(НСтр("ru = 'Этап принял к исполнению пользователь %1'"), МассивПринялКИсполнению[0]);
			Иначе
				Сообщение.Текст = НСтр("ru = 'Текущий пользователь не может согласовывать документ на данном этапе'");
			КонецЕсли;
			
			Сообщение.Сообщить();
			Возврат;
			
		ИначеЕсли ТекущиеЭтапыСогласования.Количество() = 0 И ЕстьСуперПользовательПоОрганизации Тогда
			
			//Вывести историю согласования
			ОтчетПоИстории = Отчеты.ИсторияСогласования.Создать();
			ОтчетПоИстории.КлючевойОбъектПроцесса = СогласовываемыйДокумент;
			ОтчетПоИстории.ВывестиОтчетКомментарии(ТД_ИсторияСогласования);
			ВысотаТабДок = ТД_ИсторияСогласования.ВысотаТаблицы;
			Элементы.ТД_ИсторияСогласования.ТекущаяОбласть = ТД_ИсторияСогласования.Область(ВысотаТабДок, 1, ВысотаТабДок, 1);
			
			Элементы.ТаблицаПакетаДокументов.Видимость = Ложь;
			Элементы.ПринятьКИсполнению.Видимость = Ложь;
			Элементы.ОтменитьПринятиеКИсполнению.Видимость = Ложь;
			Элементы.СогласоватьОтчет.Видимость = Ложь;
			Элементы.ОтклонитьОтчет.Видимость = Ложь;
			Элементы.ВернутьИсполнителю.Видимость = Ложь;
			Элементы.ДобавитьСогласующих.Видимость = Ложь;
			
			ТаблицаОтветственныхПользователей = МодульУправленияПроцессамиУХ.ОтветственныеПользователиПоОбъектуСогласования(СогласовываемыйДокумент, СписокЗадач);	
			ТаблицаОтветственныхПользователей.Свернуть("Пользователь, ПринялКИсполнению");
			
			Для Каждого СтрокаОтветственныйПользователь Из ТаблицаОтветственныхПользователей Цикл
				Если СтрокаОтветственныйПользователь.ПринялКИсполнению <> Справочники.Пользователи.ПустаяСсылка() Тогда
					Элементы.ОтменитьПринятиеКИсполнению.Видимость = Истина;
					Возврат;
				КонецЕсли;
			КонецЦикла;
			
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Текущий пользователь не может согласовывать документ на данном этапе'");
			Сообщение.Сообщить();
			Возврат;
			
		Иначе
			ПерваяСтрокаЭтапа = ТекущиеЭтапыСогласования[0];
			Наименование = ПерваяСтрокаЭтапа.ЭтапПроцесса;
			ЗначениеВРеквизитФормы(МодульУправленияПроцессамиУХ.ПолучитьИсториюСогласованияЭтапа(Наименование, СогласовываемыйДокумент), "ТаблицаСогласования");
			ЕстьСуперПользователь  = МодульСогласованияДокументовУХ.ЕстьСуперПользователь(ДействияСогласованиеУХСервер.ВернутьЦФОПоОбъекту(СогласовываемыйДокумент));
			// Выведем количество доп согласующих.
			ДобавитьТекстКоличествоДопСогласующих();
		КонецЕсли;
		//Вывести историю согласования
		ОтчетПоИстории = Отчеты.ИсторияСогласования.Создать();
		ОтчетПоИстории.КлючевойОбъектПроцесса = СогласовываемыйДокумент;
		ОтчетПоИстории.ВывестиОтчетКомментарии(ТД_ИсторияСогласования);
		ВысотаТабДок = ТД_ИсторияСогласования.ВысотаТаблицы;
		Элементы.ТД_ИсторияСогласования.ТекущаяОбласть = ТД_ИсторияСогласования.Область(ВысотаТабДок, 1, ВысотаТабДок, 1);
	Иначе
		Если ПакетДокументов.Количество() > 0 Тогда
			ТекЭтап = Неопределено;
			Для Каждого Док Из ПакетДокументов Цикл
				ЗначениеВРеквизитФормы(МодульУправленияПроцессамиУХ.ЭтапыСогласованияДляТекущегоПользователя(Док.Значение, СписокЗадач), "ТекущиеЭтапыСогласования");
				Если ТекущиеЭтапыСогласования.Количество() = 0  Тогда
					Отказ  = Истина;
					ТекстСообщения = НСтр("ru = 'Текущий пользователь не может согласовывать документ ""%Документ%""'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", Строка(Док.Значение));
					ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
					Возврат;
				Иначе
					Если ТекЭтап = Неопределено Тогда
						ТекЭтап = ТекущиеЭтапыСогласования[0].ЭтапПроцесса;
						Продолжить;
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
			// Отобразим таблицу документов.
			ВывестиТаблицуПакетаДокументов();
		Иначе
			Отказ  = Истина;
			ТекстСообщения = НСтр("ru = 'Передан пустой пакет документов на согласование'");
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	ОтборЭтап = Новый Структура("Этап", ТекущиеЭтапыСогласования[0].ЭтапПроцесса);
	УтверждающиеДобавленные = ТекущиеЭтапыСогласования[0].ДокументПроцесса.ДополнительныеСогласующие.Выгрузить(ОтборЭтап);
	Для каждого СтрУтв Из УтверждающиеДобавленные Цикл
		НовСогл = ДопСогласующие.Добавить();
		НовСогл.Пользователь       = СтрУтв.Пользователь;
		НовСогл.ДобавленИзМаршрута = Ложь;
	КонецЦикла;
	УправлениеДоступностью();
	// Отображение команды ОтклонитьОтчет.
	Если НЕ ЕстьСогласовываемыйДокумент Тогда
		Элементы.ОтклонитьОтчет.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьДопСогласующих" Тогда
		ДобавитьТекстКоличествоДопСогласующих();
	Иначе
		// Неизвестное оповещение. Ничего не делаем.
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Отказ = Ложь;
	Если ЭтаФорма.Модифицированность Тогда
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Виза сохранена не будет. Закрыть согласование?'");
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПодтверждениеЗакрытияЗавершение", ЭтаФорма);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);
	Иначе
		Если НЕ ЗавершениеРаботы Тогда
			Оповестить("ОбновитьМоиЗадачиИОповещения");
		Иначе
			// Не требуется изменять содержимое формы Мои оповещения. Отключено с целью избежать серверных вызовов.
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СписокВыбора = Новый СписокЗначений;
	Для Каждого ТекЭлемент Из ТекущиеЭтапыСогласования Цикл
		СписокВыбора.Добавить(ТекЭлемент.ЭтапПроцесса);
	КонецЦикла;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьЭтапаЗавершение", ЭтотОбъект);
	ПоказатьВыборИзСписка(ОписаниеОповещения, СписокВыбора, Элемент,  СписокВыбора.НайтиПоЗначению(Наименование));

КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеСогласующиеНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбратьДополнительныхСогласующих();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаПакетаДокументов

&НаКлиенте
Процедура ТаблицаПакетаДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.ТаблицаПакетаДокументов.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если ТекДанные.Свойство("ОбъектСогласования") Тогда
			ПоказатьЗначение(, ТекДанные.ОбъектСогласования);
		Иначе
			// Объекта согласования нет. Ничего не делаем.
		КонецЕсли;
	Иначе
		// Строка не выбрана. Ничего не делаем.
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СогласоватьОтчет(Команда)
	// Получения данных для обработки.
	Если СогласовываемыйДокумент <> Неопределено Тогда
		ПакетДокументов = Новый СписокЗначений;
		ПакетДокументов.Добавить(СогласовываемыйДокумент);
		ТекущийЭтап = ВернутьМассивДляПередачиПоОповещению();
	Иначе
		ТекущийЭтап = ВернутьМассивДляПередачиПоОповещению();
	КонецЕсли;
	// Обход полученных данных.
	СоответствиеДанныхЭтапов = СоответствиеДанныхТекущихЭтапов(ТекущийЭтап);
	РазрешеноЗакрытие = Истина;
	
	ЕстьТекущийПользователь = Ложь;
	Для Каждого СтрЭтап ИЗ ТекущийЭтап Цикл
		Если СтрЭтап.Пользователь = ТекПользователь Тогда
			ЕстьТекущийПользователь = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
		
	Для Каждого СтрЭтап ИЗ ТекущийЭтап Цикл
		Замещение = (СтрЭтап.Пользователь <> ТекПользователь);
		
		Если Замещение И ЕстьТекущийПользователь Тогда
			Продолжить;
		КонецЕсли;
				
		ТекЭтап = СтрЭтап.Этап;
		// Проверим, что заполнен комментарий при утверждении.
		СтруктураДанныхЭтапа = СоответствиеДанныхЭтапов.Получить(ТекЭтап);
		Если СтруктураДанныхЭтапа <> Неопределено Тогда
			ОбязательныйКомментарийПриСогласовании = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураДанныхЭтапа, "ОбязательныйКомментарийПриСогласовании", Ложь);
		Иначе
			ОбязательныйКомментарийПриСогласовании = Ложь;
		КонецЕсли;
		НовыйКоментарий = Комментарий.ПолучитьТекст();
		Если (НЕ ОбязательныйКомментарийПриСогласовании) ИЛИ (СокрЛП(НовыйКоментарий) <> "") Тогда
			
			ИдентификаторФормы = ИдентификаторФормыВладельца(ВладелецФормы);
			
			Если СтрЭтап.ДопСогласование Тогда
				// Виза доп согласующих.
				МодульСогласованияДокументовУХ.УтвердитьЭтапДополнительногоСогласования(
					СтрЭтап.Пользователь, СтрЭтап.ДокументСогласования, ТекЭтап, СтрЭтап.Комментарий,
					СтрЭтап.Организация, Замещение, ИдентификаторФормы);
			Иначе
				// Непосредственное утверждение.
				ТекущийЭтап_ = Новый Структура();
				ТекущийЭтап_.Вставить("Этап", ТекЭтап);
				ТекущийЭтап_.Вставить("ДокументСогласования", СтрЭтап.ДокументСогласования);
				ТекущийЭтап_.Вставить("Организация", СтрЭтап.Организация);
				ТекущийЭтап_.Вставить("Комментарий", НовыйКоментарий);
				
				МодульУправленияПроцессамиУХ.УтвердитьЭтап(, ТекущийЭтап_, СтрЭтап.ТекущийДокумент,
					СтрЭтап.Пользователь, Замещение, ИдентификаторФормы);
				
			КонецЕсли;
		Иначе
			ТекстСообщения = НСтр("ru = 'Требуется ввести комментарий перед утверждением'");
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
			РазрешеноЗакрытие = Ложь;
		КонецЕсли;
	КонецЦикла;
	// Обновление интерфейса.
	Оповестить("ОбновитьМоиЗадачиИОповещения");
	Оповестить("СостояниеЗаявкиПриИзменении");
	Если РазрешеноЗакрытие Тогда
		Модифицированность = Ложь;
		Закрыть(Новый Структура("Режим","КнопкаСогласовать"));
	Иначе
		// Не закрываем форму.
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьОтчет(Команда)
	// Получения данных для обработки.
	Если СогласовываемыйДокумент <> Неопределено Тогда
		ПакетДокументов = Новый СписокЗначений;
		ПакетДокументов.Добавить(СогласовываемыйДокумент);
		ТекущийЭтап = ВернутьМассивДляПередачиПоОповещению();
	Иначе
		ТекущийЭтап = ВернутьМассивДляПередачиПоОповещению();
	КонецЕсли;
	// Обход полученных данных.
	СоответствиеДанныхЭтапов = СоответствиеДанныхТекущихЭтапов(ТекущийЭтап);
	РазрешеноЗакрытие = Истина;
	Для Каждого СтрЭтап ИЗ ТекущийЭтап Цикл
		ТекЭтап = СтрЭтап.Этап;
		// Проверим, что заполнен комментарий при отклонении.
		СтруктураДанныхЭтапа = СоответствиеДанныхЭтапов.Получить(ТекЭтап);
		Если СтруктураДанныхЭтапа <> Неопределено Тогда
			ОбязательныйКомментарийПриОтклонении = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураДанныхЭтапа, "ОбязательныйКомментарийПриОтклонении", Ложь);
		Иначе
			ОбязательныйКомментарийПриОтклонении = Ложь;
		КонецЕсли;
		НовыйКоментарий = Комментарий.ПолучитьТекст();
		Если (НЕ ОбязательныйКомментарийПриОтклонении) ИЛИ (СокрЛП(НовыйКоментарий) <> "") Тогда
			
			ИдентификаторФормы = ИдентификаторФормыВладельца(ВладелецФормы);
			
			// Виза доп согласующих.
			Если СтрЭтап.ДопСогласование Тогда
				МодульСогласованияДокументовУХ.ПоставитьДопВизу(СтрЭтап.Пользователь, СтрЭтап.ДокументСогласования,
					СтрЭтап.Этап, Ложь, СтрЭтап.Комментарий, СтрЭтап.Организация,, ИдентификаторФормы);
			Иначе
				// Т.к. отклонить имеет право любой участник согласования, после установки визы доп согласующего продолжаем выполнение по стандартному алгоритму.
			КонецЕсли;  
			// Непосредственное отклонение.
			Замещение = (СтрЭтап.Пользователь <> ТекПользователь);
			ТекущийЭтап_ = Новый Структура();
			ТекущийЭтап_.Вставить("Этап", СтрЭтап.Этап);
			ТекущийЭтап_.Вставить("ДокументСогласования", СтрЭтап.ДокументСогласования);
			ТекущийЭтап_.Вставить("Организация", СтрЭтап.Организация);
			ТекущийЭтап_.Вставить("Комментарий", Комментарий.ПолучитьТекст());
			
			МодульУправленияПроцессамиУХ.ОтклонитьЭтап(,ТекущийЭтап_, СтрЭтап.ТекущийДокумент,
				СтрЭтап.Пользователь, Замещение,, ИдентификаторФормы);
			
		Иначе
			ТекстСообщения = НСтр("ru = 'Требуется ввести комментарий перед отклонением'");
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
			РазрешеноЗакрытие = Ложь;
		КонецЕсли;
	КонецЦикла;
	// Обновление интерфейса.
	Оповестить("ОбновитьМоиЗадачиИОповещения");		
	Оповестить("СостояниеЗаявкиПриИзменении");
	Если РазрешеноЗакрытие Тогда
		ЭтаФорма.Модифицированность = Ложь;
		Закрыть(Новый Структура("Режим","КнопкаОтклонить"));
	Иначе
		// Не закрываем форму.
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВернутьИсполнителю(Команда)
	// Получения данных для обработки.
	ТекущийЭтап = Новый Массив;
	Если СогласовываемыйДокумент <> Неопределено Тогда
		ПакетДокументов = Новый СписокЗначений;
		ПакетДокументов.Добавить(СогласовываемыйДокумент);
		ТекущийЭтап = ВернутьМассивДляПередачиПоОповещению();
	Иначе
		ТекущийЭтап = ВернутьМассивДляПередачиПоОповещению();
	КонецЕсли;
	// Обход полученных данных.
	СоответствиеДанныхЭтапов = СоответствиеДанныхТекущихЭтапов(ТекущийЭтап);
	РазрешеноЗакрытие = Истина;
	Для Каждого СтрЭтап ИЗ ТекущийЭтап Цикл   
		ТекЭтап = СтрЭтап.Этап;
		// Проверим, что заполнен комментарий при отклонении.
		СтруктураДанныхЭтапа = СоответствиеДанныхЭтапов.Получить(ТекЭтап);
		Если СтруктураДанныхЭтапа <> Неопределено Тогда
			ОбязательныйКомментарийПриОтклонении = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураДанныхЭтапа, "ОбязательныйКомментарийПриОтклонении", Ложь);
		Иначе
			ОбязательныйКомментарийПриОтклонении = Ложь;
		КонецЕсли;
		НовыйКоментарий = Комментарий.ПолучитьТекст();
		Если (НЕ ОбязательныйКомментарийПриОтклонении) ИЛИ (СокрЛП(НовыйКоментарий) <> "") Тогда
			
			ИдентификаторФормы = ИдентификаторФормыВладельца(ВладелецФормы);
			
			// Виза дополнительных согласующих.
			Замещение = (СтрЭтап.Пользователь <> ТекПользователь);
			Если СтрЭтап.ДопСогласование Тогда
				МодульСогласованияДокументовУХ.ПоставитьДопВизу(СтрЭтап.Пользователь, СтрЭтап.ДокументСогласования,
					ТекЭтап, Ложь, СтрЭтап.Комментарий, СтрЭтап.Организация,, ИдентификаторФормы);
			Иначе
				// Т.к. отклонить имеет право любой участник согласования, после установки визы доп согласующего продолжаем выполнение по стандартному алгоритму.
			КонецЕсли;  
			// Непосредственное отклонение.
			ТекущийЭтап_ = Новый Структура();
			ТекущийЭтап_.Вставить("Этап",					 ТекЭтап);
			ТекущийЭтап_.Вставить("ДокументСогласования",	 СтрЭтап.ДокументСогласования);
			ТекущийЭтап_.Вставить("Организация",			 СтрЭтап.Организация);
			ТекущийЭтап_.Вставить("Комментарий",			 НовыйКоментарий);
			
			МодульУправленияПроцессамиУХ.ВернутьДокументНаДоработку(, ТекущийЭтап_, СтрЭтап.ТекущийДокумент,
				СтрЭтап.Пользователь, Замещение,, ИдентификаторФормы);
			
			ВладелецЭтойФормы = ЭтаФорма.ВладелецФормы;
			Если НужноПеречитатьФрорму(ВладелецЭтойФормы) Тогда
				ВладелецЭтойФормы.Прочитать();
			Иначе
				// Не перечитываем форму владельца.
			КонецЕсли;	
		Иначе
			ТекстСообщения = НСтр("ru = 'Требуется ввести комментарий перед отклонением'");
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
			РазрешеноЗакрытие = Ложь;
		КонецЕсли;
	КонецЦикла;
	// Обновление интерфейса.
	Оповестить("ОбновитьМоиЗадачиИОповещения");
	Оповестить("СостояниеЗаявкиПриИзменении");
	Если РазрешеноЗакрытие Тогда
		ЭтаФорма.Модифицированность = Ложь;
		Закрыть(Новый Структура("Режим","КнопкаВернутьИнициатору"));
	Иначе
		// Не закрываем форму.
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МаршрутСогласования(Команда)
	Если ЗначениеЗаполнено(СогласовываемыйДокумент) Тогда
		// Согласование для одного объекта.
		ДействияСогласованиеУХКлиент.МаршрутСогласования(ЭтаФорма, СогласовываемыйДокумент);
	Иначе	
		// Множественное согласование. Выведем маршрут текущего объекта.
		ТекущиеДанные = Элементы.ТаблицаПакетаДокументов.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекущиеДанные.ОбъектСогласования) Тогда
			ДействияСогласованиеУХКлиент.МаршрутСогласования(ЭтаФорма,ТекущиеДанные.ОбъектСогласования);
		Иначе
			Возврат; // Нет ссылки. Не показываем маршрут.
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСогласования(Команда)
	Если ЗначениеЗаполнено(СогласовываемыйДокумент) Тогда
		// Согласование для одного объекта.
		ДействияСогласованиеУХКлиент.ИсторияСогласования(ЭтаФорма, СогласовываемыйДокумент);
	Иначе
		// Множественное согласование. Выведем историю текущего объекта.
		ТекущиеДанные = Элементы.ТаблицаПакетаДокументов.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекущиеДанные.ОбъектСогласования) Тогда
			ДействияСогласованиеУХКлиент.ИсторияСогласования(ЭтаФорма,ТекущиеДанные.ОбъектСогласования);
		Иначе
			Возврат; // Нет ссылки. Не показываем историю.
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Делегировать(Команда)
	
	СтруктураПараметров = Новый Структура;
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеВводаПользователяДляДелегирования", ЭтотОбъект, СтруктураПараметров);
	
	СкрываемыеПользователи = Новый СписокЗначений;
	СкрываемыеПользователи.Добавить(ТекПользователь);
	ПараметрыОтбораПользователя = Новый Структура(
		"РежимВыбора, СкрываемыеПользователи",
		Истина, СкрываемыеПользователи);
	
	ОткрытьФорму("Справочник.Пользователи.ФормаСписка", ПараметрыОтбораПользователя, ЭтотОбъект, , , , ОповещениеОЗакрытии);

КонецПроцедуры

&НаКлиенте
Процедура ПринятьКИсполнению(Команда)
		
	// Получения данных для обработки.
	Если СогласовываемыйДокумент <> Неопределено Тогда
		ПакетДокументов = Новый СписокЗначений;
		ПакетДокументов.Добавить(СогласовываемыйДокумент);
		ТекущийЭтап = ВернутьМассивДляПередачиПоОповещению();
	Иначе
		ТекущийЭтап = ВернутьМассивДляПередачиПоОповещению();
	КонецЕсли;
	
	// Обход полученных данных.
	СоответствиеДанныхЭтапов = СоответствиеДанныхТекущихЭтапов(ТекущийЭтап);
	РазрешеноЗакрытие = Истина;
	
	Для Каждого СтрЭтап ИЗ ТекущийЭтап Цикл
				
		ТекЭтап = СтрЭтап.Этап;
		// Проверим, что заполнен комментарий при утверждении.
		СтруктураДанныхЭтапа = СоответствиеДанныхЭтапов.Получить(ТекЭтап);
		
		Если СтруктураДанныхЭтапа <> Неопределено Тогда
			ОбязательныйКомментарийПриСогласовании = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураДанныхЭтапа, "ОбязательныйКомментарийПриСогласовании", Ложь);
		Иначе
			ОбязательныйКомментарийПриСогласовании = Ложь;
		КонецЕсли;
		
		НовыйКоментарий = Комментарий.ПолучитьТекст();
		
		Если (НЕ ОбязательныйКомментарийПриСогласовании) ИЛИ (СокрЛП(НовыйКоментарий) <> "") Тогда
			
			ИдентификаторФормы = ИдентификаторФормыВладельца(ВладелецФормы);
			ДополнительныеПараметры = Новый Структура("ИдентификаторФормыДляВыводаПротокола", ИдентификаторФормы);
			МодульУправленияПроцессамиУХ.ПринятьЭтапКИсполнению(СтрЭтап.ДокументСогласования, СтрЭтап.Организация,
				ТекЭтап,, НовыйКоментарий, Истина,, ДополнительныеПараметры);
			
		Иначе
			ТекстСообщения = НСтр("ru = 'Требуется ввести комментарий перед утверждением'");
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
			РазрешеноЗакрытие = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	// Обновление интерфейса.
	Оповестить("ОбновитьМоиЗадачиИОповещения");
	Оповестить("СостояниеЗаявкиПриИзменении");
	
	Если РазрешеноЗакрытие Тогда
		Модифицированность = Ложь;
		Закрыть(Новый Структура("Режим","КнопкаСогласовать"));
	Иначе
		// Не закрываем форму.
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСогласующих(Команда)
	ВыбратьДополнительныхСогласующих();
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПринятиеКИсполнению(Команда)
	
	// Получения данных для обработки.
	Если СогласовываемыйДокумент <> Неопределено Тогда
		ПакетДокументов = Новый СписокЗначений;
		ПакетДокументов.Добавить(СогласовываемыйДокумент);
		ТекущийЭтап = ВернутьМассивДляПередачиПоОповещению();
	Иначе
		ТекущийЭтап = ВернутьМассивДляПередачиПоОповещению();
	КонецЕсли;
	
	ОрганизацияОбъекта = МодульУправленияПроцессамиУХ.ПолучитьОрганизациюОбъекта(СогласовываемыйДокумент);
	ЕстьСуперПользователь = МодульСогласованияДокументовУХ.ЕстьСуперПользователь(ОрганизацияОбъекта);
	Если ТекущийЭтап.Количество() = 0 И ЕстьСуперПользователь Тогда		
		ТекущийЭтап = ВернутьМассивДляПередачиПоОповещениюСуперпользователь();
	КонецЕсли;
		
	// Обход полученных данных.
	СоответствиеДанныхЭтапов = СоответствиеДанныхТекущихЭтапов(ТекущийЭтап);
	РазрешеноЗакрытие = Истина;
	
	Для Каждого СтрЭтап ИЗ ТекущийЭтап Цикл
				
		ТекЭтап = СтрЭтап.Этап;
		// Проверим, что заполнен комментарий при утверждении.
		СтруктураДанныхЭтапа = СоответствиеДанныхЭтапов.Получить(ТекЭтап);
		
		Если СтруктураДанныхЭтапа <> Неопределено Тогда
			ОбязательныйКомментарийПриСогласовании = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураДанныхЭтапа, "ОбязательныйКомментарийПриСогласовании", Ложь);
		Иначе
			ОбязательныйКомментарийПриСогласовании = Ложь;
		КонецЕсли;
		
		НовыйКоментарий = Комментарий.ПолучитьТекст();
		
		Если (НЕ ОбязательныйКомментарийПриСогласовании) ИЛИ (СокрЛП(НовыйКоментарий) <> "") Тогда
			
			ИдентификаторФормы = ИдентификаторФормыВладельца(ВладелецФормы);
			ДополнительныеПараметры = Новый Структура("ИдентификаторФормыДляВыводаПротокола", ИдентификаторФормы);
			МодульУправленияПроцессамиУХ.ОтменитьПринятиеКИсполнению(СтрЭтап.ДокументСогласования, СтрЭтап.Организация,
				ТекЭтап,, НовыйКоментарий, Истина,, ДополнительныеПараметры);
			
		Иначе
			ТекстСообщения = НСтр("ru = 'Требуется ввести комментарий перед утверждением'");
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
			РазрешеноЗакрытие = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	// Обновление интерфейса.
	Оповестить("ОбновитьМоиЗадачиИОповещения");
	Оповестить("СостояниеЗаявкиПриИзменении");
	
	Если РазрешеноЗакрытие Тогда
		Модифицированность = Ложь;
		Закрыть(Новый Структура("Режим","КнопкаСогласовать"));
	Иначе
		// Не закрываем форму.
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Отображает диалог выбора дополнительных согласующих.
&НаКлиенте
Процедура ВыбратьДополнительныхСогласующих()
	
	Перем ВыбранноеЗначение;
	// Получим массив различных этапов, исключая дубликаты для разных пользователей.
	МассивРазличныхЭтапов = Новый Массив;
	Для Каждого ТекТекущиеЭтапыСогласования Из ТекущиеЭтапыСогласования Цикл
		Если МассивРазличныхЭтапов.Найти(ТекТекущиеЭтапыСогласования.ЭтапПроцесса) = Неопределено Тогда
			МассивРазличныхЭтапов.Добавить(ТекТекущиеЭтапыСогласования.ЭтапПроцесса);
		Иначе
			Продолжить;		// Выполняем поиск далее.
		КонецЕсли;	
	КонецЦикла;	
	// Убедимся, что этап единственный. В случае успеха - вызовем форму дополнительного согласования.
	Если МассивРазличныхЭтапов.Количество() = 0 Тогда
		ТекстОшибки = НСтр("ru = 'Не удалось получить этапы согласования. Операция отменена.'");
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстОшибки);
	ИначеЕсли МассивРазличныхЭтапов.Количество() = 1 Тогда	
		Строка = ТекущиеЭтапыСогласования.НайтиСтроки(Новый Структура("ЭтапПроцесса", Наименование))[0];
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ЭкземплярПроцесса", Строка.ДокументПроцесса);
		СтруктураПараметров.Вставить("ЭтапСогласования", Наименование);
		ОткрытьФорму("Обработка.ДополнительноеСогласование.Форма.Форма", СтруктураПараметров, , , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
	Иначе
		ТекстОшибки = НСтр("ru = 'Запрещено добавлять согласующих на несколько этапов согласования. Операция отменена.'");
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстОшибки);
	КонецЕсли;
КонецПроцедуры

// Управляет доступностью элементов формы.
&НаСервере
Процедура УправлениеДоступностью()
	// Доступность команд Согласовать, На шаг назад и Отклонить в зависимости от режима открытия.
	ЭтоУтверждение	 = (СокрЛП(РежимСогласования) = "Утверждение");
	ЭтоОтклонение	 = (СокрЛП(РежимСогласования) = "Отклонение");
	ЭтоНаШагНазад	 = (СокрЛП(РежимСогласования) = "НаШагНазад");
	ЭтоПринятиеКИсполнению = (СокрЛП(РежимСогласования) = "ПринятьКИсполнению");
	ЭтоОтменаПринятияКИсполнению = (СокрЛП(РежимСогласования) = "ОтменитьПринятиеКИсполнению");
	Если СокрЛП(РежимСогласования) = "" Тогда
		// Общий режим, не изменяем доступность команд.
	Иначе
				
		НужноСкрытьУтверждение	 = ЭтоНаШагНазад ИЛИ ЭтоОтклонение ИЛИ ЭтоПринятиеКИсполнению ИЛИ ЭтоОтменаПринятияКИсполнению;
		НужноСкрытьНаШагНазад	 = ЭтоУтверждение ИЛИ ЭтоОтклонение ИЛИ ЭтоПринятиеКИсполнению ИЛИ ЭтоОтменаПринятияКИсполнению;
		НужноСкрытьОтклонение	 = ЭтоУтверждение ИЛИ ЭтоНаШагНазад ИЛИ ЭтоПринятиеКИсполнению ИЛИ ЭтоОтменаПринятияКИсполнению;
				
		Если НужноСкрытьУтверждение Тогда
			Элементы.СогласоватьОтчет.Видимость		 = Ложь;
		КонецЕсли;
		Если НужноСкрытьНаШагНазад Тогда
			Элементы.ОтклонитьОтчет.Видимость		 = Ложь;
		КонецЕсли;
		Если НужноСкрытьОтклонение Тогда
			Элементы.ВернутьИсполнителю.Видимость	 = Ложь;
		КонецЕсли;
	КонецЕсли;
		
	АдресКэшаПерехода = ПоместитьВоВременноеХранилище("Неопределено");
	ПараметрыКэширования = Новый Структура("АдресКэшаПерехода", АдресКэшаПерехода);
		
	// Видимость кнопки На шаг назад в зависимости от этапов предшественников.
	Если ТекущиеЭтапыСогласования.Количество() > 0 Тогда
		ПерваяСтрокаЭтапа = ТекущиеЭтапыСогласования[0];
		МассивЭтаповПредшественников = Новый Массив;
		ТекЭтап = ПерваяСтрокаЭтапа.ЭтапПроцесса;
		ТекПроцесс = ПерваяСтрокаЭтапа.ДокументПроцесса;
		
		МассивЭтаповПредшественников = МодульУправленияПроцессамиУХ.ПолучитьМассивПредшественниковЭтапаРекурсивно(ТекЭтап, ТекПроцесс, Истина, ПараметрыКэширования);
		
		Попытка    
			УдалитьИзВременногоХранилища(АдресКэшаПерехода);
		Исключение
		КонецПопытки;
				
		МассивЭтаповПредшественников = МодульРегламентныхЗаданийУХ.ОтделитьНеЭтапыСогласования(МассивЭтаповПредшественников); 
		ЕстьПредшественники = МассивЭтаповПредшественников.Количество() <> 0;
		Если Не ЕстьПредшественники Тогда
			Элементы.ОтклонитьОтчет.Видимость = Ложь;
		Иначе
			// Оставляем видимость команды прежней.
		КонецЕсли;
	Иначе
		// Нет этапов. Не изменяем видимость команды.
	КонецЕсли;
	// Доступность команды Добавить согласующих.
	Элементы.ДобавитьСогласующих.Доступность = ЗначениеЗаполнено(СогласовываемыйДокумент);
	Элементы.ДополнительныеСогласующие.Видимость = ЗначениеЗаполнено(СогласовываемыйДокумент);
	// Блокировка отклонения для этапа Обработка.
	Если ЗначениеЗаполнено(Наименование) Тогда
		ЭтоЭтапОбработка = (Наименование.ТипЭтапа = Перечисления.ТипыЭтаповУниверсальныхПроцессов.ОбработкаУниверсальногоПроцесса);
		Если ЭтоЭтапОбработка Тогда
			Элементы.ВернутьИсполнителю.Видимость	 = Ложь;
			Элементы.ОтклонитьОтчет.Видимость		 = Ложь;
		Иначе
			// Оставляем видимость элементов прежней.
		КонецЕсли;
	Иначе
		// Этап не заполнен.
	КонецЕсли;	
	// Отображение элементов в зависимости от множественного/единичного режима.
	ЕстьСогласовываемыйДокумент = (СогласовываемыйДокумент <> Неопределено);
	Элементы.ХодСогласования.Видимость = ЕстьСогласовываемыйДокумент;
	Элементы.ЭтапСогласования.Видимость = ЕстьСогласовываемыйДокумент;
	Элементы.ТаблицаПакетаДокументов.Видимость = Не ЕстьСогласовываемыйДокумент;
	Если ЕстьСогласовываемыйДокумент Тогда
		Элементы.ГруппаКомментарий.Заголовок = НСтр("ru = 'Виза (пометка, пояснение): '");
	Иначе
		Элементы.ГруппаКомментарий.Заголовок = НСтр("ru = 'Виза (пометка, пояснение ко всем документам): '");
	КонецЕсли;
	
	//Видимость кнопки "Принять к исполнению"
	Элементы.ПринятьКИсполнению.Видимость = Ложь;
	Элементы.ОтменитьПринятиеКИсполнению.Видимость = Ложь;
	
	Если ЗначениеЗаполнено(Наименование) Тогда
		Если Наименование.ТипЭтапа = Перечисления.ТипыЭтаповУниверсальныхПроцессов.ЭтапСогласования Тогда
			
			ТекПользователь = ОбщегоНазначенияУХ.ПолучитьЗначениеПеременной("глТекущийПользователь");
			
			ТаблицаОтветственныхПользователей = МодульУправленияПроцессамиУХ.ОтветственныеПользователиПоОбъектуСогласования(СогласовываемыйДокумент, СписокЗадач);
			ТаблицаОтветственныхПользователей.Свернуть("Пользователь, ДопСогласование, ПринялКИсполнению");
						
			ПользовательБотЗадачИОповещений = Справочники.Пользователи.НайтиПоНаименованию(НСтр("ru = 'Бот задач и оповещений'", ОбщегоНазначения.КодОсновногоЯзыка()), Истина);
			
			Если ЗначениеЗаполнено(ПользовательБотЗадачИОповещений) Тогда
				СтрокиБотЗадачИОповещений = ТаблицаОтветственныхПользователей.НайтиСтроки(Новый Структура("Пользователь", ПользовательБотЗадачИОповещений));
				
				Для Каждого СтрокаБот Из СтрокиБотЗадачИОповещений Цикл
					ТаблицаОтветственныхПользователей.Удалить(СтрокаБот);
				КонецЦикла;
			КонецЕсли;
			
			ТекущийПользовательИсполняющий = ТаблицаОтветственныхПользователей.Найти(ТекПользователь, "ПринялКИсполнению");			
			ТекущийПользовательДополнительныйСтроки = ТаблицаОтветственныхПользователей.НайтиСтроки(Новый Структура("Пользователь, ДопСогласование", ТекПользователь, Истина));
			МассивОсновныхСогласующих = ТаблицаОтветственныхПользователей.НайтиСтроки(Новый Структура("ДопСогласование", Ложь));
			
			Элементы.ПринятьКИсполнению.Видимость = (МассивОсновныхСогласующих.Количество() > 1)
													И (ТекущийПользовательДополнительныйСтроки.Количество() = 0)
													И (ТекущийПользовательИсполняющий = Неопределено) 
													И (ЭтоПринятиеКИсполнению ИЛИ СокрЛП(РежимСогласования) = "");
			
			Элементы.ОтменитьПринятиеКИсполнению.Видимость = (ТекущийПользовательИсполняющий <> Неопределено) И (ЭтоОтменаПринятияКИсполнению ИЛИ СокрЛП(РежимСогласования) = "");
						
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

// Изменяет текст на кнопке дополнительного согласования.
&НаСервере
Процедура ДобавитьТекстКоличествоДопСогласующих()
	ПерваяСтрокаЭтапа = ТекущиеЭтапыСогласования[0];
	ТаблицаДопСогласующих = МодульСогласованияДокументовУХ.ПолучитьТаблицуДопСогласующихПоЭтапу(ПерваяСтрокаЭтапа.ДокументПроцесса, Наименование);
	КоличествоДопСогласующих = ТаблицаДопСогласующих.Количество();
	Если КоличествоДопСогласующих > 0 Тогда
		НовыйЗаголовок = НСтр("ru = 'Дополнительные согласующие (%КоличествоДопСогласующих%)'");
		НовыйЗаголовок = СтрЗаменить(НовыйЗаголовок, "%КоличествоДопСогласующих%", Строка(КоличествоДопСогласующих));
		Элементы.ДобавитьСогласующих.Заголовок = НовыйЗаголовок;
		НаименованияСогласующих = ТаблицаДопСогласующих.ВыгрузитьКолонку("Согласующий");
		ДополнительныеСогласующие = СтрСоединить(НаименованияСогласующих, ",");
	Иначе
		Элементы.ДобавитьСогласующих.Заголовок = НСтр("ru = 'Дополнительные согласующие'");
		ДополнительныеСогласующие = НСтр("ru = 'Добавить'")
	КонецЕсли;
КонецПроцедуры

// Заполняет таблицу пакета документов.
&НаСервере
Процедура ВывестиТаблицуПакетаДокументов()
	ТаблицаПакетаДокументов.Очистить();
	Если ЭтоАдресВременногоХранилища(АдресТаблицыЗадач) Тогда
		// Таблица задач получена ранее. Заполним по ней.
		ТаблицаЗадач = ПолучитьИзВременногоХранилища(АдресТаблицыЗадач);
		ТаблицаЗадачРабочая = ТаблицаЗадач.Скопировать();
		ТаблицаЗадачРабочая.Свернуть("Ссылка, Этап, Замещаемый, Пользователь");
		Для Каждого ТекТаблицаЗадачРабочая Из ТаблицаЗадачРабочая Цикл
			НоваяСтрока = ТаблицаПакетаДокументов.Добавить();
			НоваяСтрока.ОбъектСогласования	 = ТекТаблицаЗадачРабочая.Ссылка;
			НоваяСтрока.Этап				 = ТекТаблицаЗадачРабочая.Этап;
			Если ЗначениеЗаполнено(ТекТаблицаЗадачРабочая.Замещаемый) Тогда
				НоваяСтрока.Ответственный	 = ТекТаблицаЗадачРабочая.Замещаемый;
			Иначе
				НоваяСтрока.Ответственный	 = ТекТаблицаЗадачРабочая.Пользователь;
			КонецЕсли;
		КонецЦикла;
	Иначе
		// Таблица задач не передана. Получим данные снова.
		ТаблицаПараметровЗадач = Справочники.Задачи.ПолучитьТаблицуПараметровЗадач(СписокЗадач);
		ТаблицаПараметровЗадач.Свернуть("ЭтапПроцесса, Ответственный, Выполнено, СвязанныйОбъект");	
		МассивПользователей = МодульУправленияПроцессамиУХ.ПолучитьЗамещаемыхТекущегоПользователя(ТекПользователь);
		МассивПользователей.Добавить(ТекПользователь);
		Для Каждого ТекТаблицаПараметровЗадач Из ТаблицаПараметровЗадач Цикл
			Если Не ТекТаблицаПараметровЗадач.Выполнено Тогда
				Если МассивПользователей.Найти(ТекТаблицаПараметровЗадач.Ответственный) <> Неопределено Тогда
					НоваяСтрока = ТаблицаПакетаДокументов.Добавить();
					НоваяСтрока.ОбъектСогласования = ТекТаблицаПараметровЗадач.СвязанныйОбъект;
					НоваяСтрока.Этап			 = ТекТаблицаПараметровЗадач.ЭтапПроцесса;
					НоваяСтрока.Ответственный	 = ТекТаблицаПараметровЗадач.Ответственный;
				Иначе
					// Задача принадлежит другому пользователю. Не выводим.
				КонецЕсли;
			Иначе
				// задача выполнена. Не отражаем в списке.
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ИдентификаторФормыВладельца(ВладелецФормы)
	
	Если ТипЗнч(ВладелецФормы) = Тип("УправляемаяФорма") Тогда
		ИдентификаторФормы = ВладелецФормы.УникальныйИдентификатор;
	Иначе
		ИдентификаторФормы = Неопределено;
	КонецЕсли;
	
	Возврат ИдентификаторФормы;
	
КонецФункции

// Определяет, принадлежит ли СсылкаВход справочнику либо документу.
&НаСервереБезКонтекста
Функция	ЭтоСсылочныйОбъект(СсылкаВход)
	РезультатФункции = Ложь;
	ЭтоСправочник = Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(СсылкаВход));
	ЭтоДокумент = Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(СсылкаВход));
	РезультатФункции = (ЭтоСправочник ИЛИ ЭтоДокумент);
	Возврат РезультатФункции;
КонецФункции		// ЭтоСсылочныйОбъект()

// Возвращает соответствие даныых этапов из массива МассивЭтаповВход.
&НаСервереБезКонтекста
Функция СоответствиеДанныхЭтапов(МассивЭтаповВход)
	РезультатФункции = Справочники.ЭтапыУниверсальныхПроцессов.СоответствиеДанныхЭтапов(МассивЭтаповВход);
	Возврат РезультатФункции;
КонецФункции

&НаСервере
Процедура ОбработатьВыборЭтапа()
		
КонецПроцедуры

&НаСервере
Функция ВернутьМассивДляПередачиПоОповещению(ПроизвольныйЭтап = Неопределено)
	ТекущийЭтап = Новый Массив;
	ПакетДокументовСвертка = ОбщегоНазначенияКлиентСерверУХ.СвернутьСписокЗначений(ПакетДокументов);
	Для Каждого Док Из ПакетДокументовСвертка Цикл
		Если СписокНеМаршрутных.НайтиПоЗначению(Док.Значение) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ТаблицаЭтаповПоТекДокументу = МодульУправленияПроцессамиУХ.ЭтапыСогласованияДляТекущегоПользователя(Док.Значение, СписокЗадач);
		ТаблицаЭтаповПоТекДокументу.Свернуть("ЭтапПроцесса, ПравоРедактирования, ДокументПроцесса, Организация, ДопСогласование, Пользователь");
		ЗначениеВРеквизитФормы(ТаблицаЭтаповПоТекДокументу, "ТекущиеЭтапыСогласования");
		ТекстКомментария = Комментарий.ПолучитьТекст();
		Для Каждого Строка Из ТекущиеЭтапыСогласования Цикл
			СтруктураДобавления = Новый Структура;
			СтруктураДобавления.Вставить("Этап",					 Строка.ЭтапПроцесса);
			СтруктураДобавления.Вставить("ДокументСогласования",	 Строка.ДокументПроцесса);
			СтруктураДобавления.Вставить("Организация",				 Строка.Организация);
			СтруктураДобавления.Вставить("Комментарий",				 ТекстКомментария);
			СтруктураДобавления.Вставить("ТекущийДокумент",			 Строка.ДокументПроцесса.КлючевойОбъектПроцесса);
			СтруктураДобавления.Вставить("ДопСогласование",			 Строка.ДопСогласование);
			СтруктураДобавления.Вставить("Пользователь",			 Строка.Пользователь);
			Если НЕ ПроизвольныйЭтап = Неопределено Тогда
				СтруктураДобавления.Вставить("ПроизвольныйЭтап", ПроизвольныйЭтап);
			КонецЕсли;
			ТекущийЭтап.Добавить(СтруктураДобавления);
		КонецЦикла;	
	КонецЦикла;
	Возврат ТекущийЭтап;
КонецФункции

&НаСервере
Функция ВернутьМассивДляПередачиПоОповещениюСуперпользователь(ПроизвольныйЭтап = Неопределено)
	ТекущийЭтап = Новый Массив;
	ПакетДокументовСвертка = ОбщегоНазначенияКлиентСерверУХ.СвернутьСписокЗначений(ПакетДокументов);
	Для Каждого Док Из ПакетДокументовСвертка Цикл
		Если СписокНеМаршрутных.НайтиПоЗначению(Док.Значение) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ТаблицаЭтаповПоТекДокументу = МодульУправленияПроцессамиУХ.ОтветственныеПользователиПоОбъектуСогласования(Док.Значение, СписокЗадач);
		ТаблицаЭтаповПоТекДокументу.Свернуть("ЭтапПроцесса, ПравоРедактирования, ДокументПроцесса, Организация, ДопСогласование, Пользователь");
		ЗначениеВРеквизитФормы(ТаблицаЭтаповПоТекДокументу, "ТекущиеЭтапыСогласования");
		ТекстКомментария = Комментарий.ПолучитьТекст();
		Для Каждого Строка Из ТекущиеЭтапыСогласования Цикл
			
			Если Строка.Пользователь = Справочники.Пользователи.НайтиПоНаименованию(ПользователиУХ.ПолучитьПредставлениеБотаЗадачИОповещений(), Истина) Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураДобавления = Новый Структура;
			СтруктураДобавления.Вставить("Этап",					 Строка.ЭтапПроцесса);
			СтруктураДобавления.Вставить("ДокументСогласования",	 Строка.ДокументПроцесса);
			СтруктураДобавления.Вставить("Организация",				 Строка.Организация);
			СтруктураДобавления.Вставить("Комментарий",				 ТекстКомментария);
			СтруктураДобавления.Вставить("ТекущийДокумент",			 Строка.ДокументПроцесса.КлючевойОбъектПроцесса);
			СтруктураДобавления.Вставить("ДопСогласование",			 Строка.ДопСогласование);
			СтруктураДобавления.Вставить("Пользователь",			 Строка.Пользователь);
			Если НЕ ПроизвольныйЭтап = Неопределено Тогда
				СтруктураДобавления.Вставить("ПроизвольныйЭтап", ПроизвольныйЭтап);
			КонецЕсли;
			ТекущийЭтап.Добавить(СтруктураДобавления);
		КонецЦикла;	
	КонецЦикла;
	Возврат ТекущийЭтап;
КонецФункции

// Возвращает соответствие даныых этапов из массива текущих этапов 
// МассивЭтаповВход.
&НаКлиенте
Функция СоответствиеДанныхТекущихЭтапов(МассивТекущихЭтаповВход)
	РезультатФункции = Новый Соответствие;
	МассивЭтапов = Новый Массив;
	Для Каждого ТекМассивТекущихЭтаповВход Из МассивТекущихЭтаповВход Цикл
		МассивЭтапов.Добавить(ТекМассивТекущихЭтаповВход.Этап);
	КонецЦикла;	
	РезультатФункции = СоответствиеДанныхЭтапов(МассивЭтапов);
	Возврат РезультатФункции;
КонецФункции		// СоответствиеДанныхТекущихЭтапов()

// Определяет, нужно ли обновить форму ФормаВход при окончании согласования.
&НаКлиенте
Функция НужноПеречитатьФрорму(ФормаВход)
	РезультатФункции = Ложь;
	Если ТипЗнч(ФормаВход) = Тип("УправляемаяФорма") Тогда
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ФормаВход, "Объект") Тогда
			ОбъектФормыВладельца = ФормаВход.Объект;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОбъектФормыВладельца, "Ссылка") Тогда
				СсылкаВладелец = ОбъектФормыВладельца.Ссылка;
				РезультатФункции = ЭтоСсылочныйОбъект(СсылкаВладелец);
			Иначе
				РезультатФункции = Ложь; // Нет ссылки. Не обновляем форму.
			КонецЕсли;
		Иначе
			РезультатФункции = Ложь; // Объект не задан. Не обновляем форму.
		КонецЕсли;
	Иначе
		РезультатФункции = Ложь; // Владельцем выступает не форма. Не обновляем его.
	КонецЕсли;	
	Возврат РезультатФункции;
КонецФункции

&НаКлиенте
Процедура ПодтверждениеЗакрытияЗавершение(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЭтаФорма.Модифицированность = Ложь;
		ЭтаФорма.Закрыть();
	Иначе
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЭтапаЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		Наименование = ВыбранноеЗначение.Значение;
		ОбработатьВыборЭтапа();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ДелегироватьЗадачу(НовыйСогласующий, ЭкземплярПроцессаВход, ЭтапПроцессаВход, ДобавившийПользователь = Неопределено) Экспорт

	РезультатФункции = Истина;
	ТекМассивСогласующихВход = Справочники.Пользователи.ПустаяСсылка();
	ЕстьОшибки = Ложь;
	ТекПользователь = ОбщегоНазначенияУХ.ПолучитьЗначениеПеременной("глТекущийПользователь");
	НачатьТранзакцию();
	Попытка
		
		МассивПользователей = МодульУправленияПроцессамиУХ.ПолучитьЗамещаемыхТекущегоПользователя(ТекПользователь);
		МассивПользователей.Добавить(ТекПользователь);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтложеннаяОбработкаЭтаповПроцессовСрезПоследних.Период КАК Период,
		|	ОтложеннаяОбработкаЭтаповПроцессовСрезПоследних.ВидДействия КАК ВидДействия,
		|	ОтложеннаяОбработкаЭтаповПроцессовСрезПоследних.ДокументПроцесса КАК ДокументПроцесса,
		|	ОтложеннаяОбработкаЭтаповПроцессовСрезПоследних.ЭтапПроцесса КАК ЭтапПроцесса,
		|	ОтложеннаяОбработкаЭтаповПроцессовСрезПоследних.Ответственный КАК Ответственный,
		|	ОтложеннаяОбработкаЭтаповПроцессовСрезПоследних.ТипКлючевогоОбъекта КАК ТипКлючевогоОбъекта,
		|	ОтложеннаяОбработкаЭтаповПроцессовСрезПоследних.Выполнено КАК Выполнено,
		|	ОтложеннаяОбработкаЭтаповПроцессовСрезПоследних.Задача КАК Задача,
		|	ОтложеннаяОбработкаЭтаповПроцессовСрезПоследних.ВремяСобытия КАК ВремяСобытия,
		|	ОтложеннаяОбработкаЭтаповПроцессовСрезПоследних.КлючевойОбъект КАК КлючевойОбъект,
		|	ОтложеннаяОбработкаЭтаповПроцессовСрезПоследних.ВремяНачалаЗадания КАК ВремяНачалаЗадания,
		|	ОтложеннаяОбработкаЭтаповПроцессовСрезПоследних.ВремяЗавершенияЗадания КАК ВремяЗавершенияЗадания,
		|	ОтложеннаяОбработкаЭтаповПроцессовСрезПоследних.ТекстКомментария КАК ТекстКомментария
		|ИЗ
		|	РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов.СрезПоследних(
		|			,
		|			Ответственный В (&ТекПользователь)
		|				И ДокументПроцесса = &ЭкземплярПроцессаВход
		|				И ЭтапПроцесса = &ЭтапПроцессаВход) КАК ОтложеннаяОбработкаЭтаповПроцессовСрезПоследних";
		
		Запрос.УстановитьПараметр("ТекПользователь", МассивПользователей);
		Запрос.УстановитьПараметр("ЭкземплярПроцессаВход", ЭкземплярПроцессаВход);
		Запрос.УстановитьПараметр("ЭтапПроцессаВход", ЭтапПроцессаВход);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		УстановитьПривилегированныйРежим(Истина);
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НоваяЗадачаПроцесса = РегистрыСведений.ОтложеннаяОбработкаЭтаповПроцессов.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(НоваяЗадачаПроцесса, ВыборкаДетальныеЗаписи);
			НоваяЗадачаПроцесса.Период = ВыборкаДетальныеЗаписи.Период;
			НоваяЗадачаПроцесса.Ответственный = НовыйСогласующий;
			НоваяЗадачаПроцесса.Записать(Истина);
			
			МодульРегламентныхЗаданийУХ.СоздатьОповещениеПоЗадаче(НоваяЗадачаПроцесса.Задача.Ссылка, НовыйСогласующий, ЭтапПроцессаВход, ЭкземплярПроцессаВход);
			КомментарийПриДелегировании = Комментарий.ПолучитьТекст();
			Если ЗначениеЗаполнено(СокрЛП(КомментарийПриДелегировании)) Тогда
				ШаблонЛога = НСтр("ru = 'Делегирование согласования: %1. Новый согласующий %2'");
				ТекстЛога = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ШаблонЛога,
					СокрЛП(КомментарийПриДелегировании),
					Строка(НовыйСогласующий));
			Иначе
				ШаблонЛога = НСтр("ru = 'Делегирование согласования: новый согласующий %1'");
				ТекстЛога = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ШаблонЛога,
					Строка(НовыйСогласующий));
			КонецЕсли;
				
			ВидОповещенияДобавленСогласующий = Перечисления.ВидыОповещенийПользователейУХ.ДобавлениеСогласующего;
			МодульУправленияПроцессамиУХ.ДобавитьЗаписьВЛогПроцесса(ЭкземплярПроцессаВход, ЭтапПроцессаВход, ТекПользователь, ТекстЛога, ВидОповещенияДобавленСогласующий);
			
			ЭкземплярПроцессаВходОбъект = ЭкземплярПроцессаВход.ПолучитьОбъект();
			СтруктураПоиска = Новый Структура("Этап", ЭтапПроцессаВход);
			ЭтапДляИзменения = ЭкземплярПроцессаВходОбъект.ДополнительныеСогласующие.НайтиСтроки(СтруктураПоиска); 
			ИзменитьЭтапЭкземпляра = Ложь;
			Для Каждого Стр Из ЭтапДляИзменения Цикл
				Если ТипЗнч(Стр.Пользователь) = Тип("СправочникСсылка.Пользователи") И Стр.Пользователь = ТекПользователь Тогда
					Стр.Пользователь    = НовыйСогласующий;
					Стр.ЭтапДелегирован = Истина;
					ИзменитьЭтапЭкземпляра = Истина;
				ИначеЕсли ТипЗнч(Стр.Пользователь) = Тип("СправочникСсылка.РолиКонтактныхЛиц") 
					Или ТипЗнч(Стр.Пользователь) = Тип("СправочникСсылка.РасширеннаяАдресацияСогласования") Тогда
					ОтветственныеПоОбъектуСогласования = МодульУправленияПроцессамиУХ.ОтветственныеПоОбъектуСогласованияПоПользователям(СогласовываемыйДокумент);
					ПараметрыПоиска = Новый Структура("Пользователь", Стр.Пользователь);
					НайденныеСтроки = ОтветственныеПоОбъектуСогласования.НайтиСтроки(ПараметрыПоиска);
					ТаблицаСогласующих = ОтветственныеПоОбъектуСогласования.СкопироватьКолонки();
					Для Каждого СтрСогласующий Из НайденныеСтроки Цикл
						НоваяСтрока = ТаблицаСогласующих.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрСогласующий);
					КонецЦикла;
					ТаблицаПользователей = МодульУправленияПроцессамиУХ.РасшифроватьРолиОтветственных(
						ЭкземплярПроцессаВход,
						ТаблицаСогласующих,
						Стр.Организация);
					Для Каждого СтрПользователь Из ТаблицаПользователей Цикл
						Если СтрПользователь.Пользователь = ТекПользователь Тогда
							ИзменитьЭтапЭкземпляра = Истина;
							Стр.Пользователь    = НовыйСогласующий;
							Стр.ЭтапДелегирован = Истина;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			
			СтараяЗадачаПроцесса = РегистрыСведений.ОтложеннаяОбработкаЭтаповПроцессов.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(СтараяЗадачаПроцесса, ВыборкаДетальныеЗаписи);
			СтараяЗадачаПроцесса.Период = ВыборкаДетальныеЗаписи.Период;
			СтараяЗадачаПроцесса.Удалить();

			Если ИзменитьЭтапЭкземпляра Тогда
				ЭкземплярПроцессаВходОбъект.Записать();
			КонецЕсли;
			
			Элементы.Делегировать.Доступность       = Ложь;
			Элементы.СогласоватьОтчет.Доступность   = Ложь;
			Элементы.ВернутьИсполнителю.Доступность = Ложь;
			
		КонецЦикла;
		
	Исключение
		ТекстОшибки = НСтр("ru = 'Не удалось делегировать согласование %НовыйСогласующий% в этап %Этап% : %ОписаниеОшибки%. Делегирование отменено.'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НовыйСогласующий%", ТекМассивСогласующихВход);
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Этап%", ЭтапПроцессаВход);
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ОписаниеОшибки%", ОписаниеОшибки());
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстОшибки);
		ЕстьОшибки = Истина;
	КонецПопытки;
	// Завершение транзакции.
	Если ЕстьОшибки Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;

	Возврат НЕ ЕстьОшибки;
	
КонецФункции

&НаКлиенте
Процедура ПослеВводаПользователяДляДелегирования(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		
		// Получения данных для обработки.
		Если СогласовываемыйДокумент <> Неопределено Тогда
			ПакетДокументов = Новый СписокЗначений;
			ПакетДокументов.Добавить(СогласовываемыйДокумент);
			ТекущийЭтап = ВернутьМассивДляПередачиПоОповещению();
		Иначе
			ТекущийЭтап = ВернутьМассивДляПередачиПоОповещению();
		КонецЕсли;
		// Обход полученных данных.
		СоответствиеДанныхЭтапов = СоответствиеДанныхТекущихЭтапов(ТекущийЭтап);
		РазрешеноЗакрытие = Истина;
		Для Каждого СтрЭтап ИЗ ТекущийЭтап Цикл
			ДокументСогласования = СтрЭтап.ДокументСогласования;
			НовыйКоментарий = Комментарий.ПолучитьТекст();
			УспешноеДелегирование = ДелегироватьЗадачу(
				ВыбранноеЗначение,
				СтрЭтап.ДокументСогласования,
				СтрЭтап.Этап);
				
			Если УспешноеДелегирование Тогда
				ТекстСообщения = НСтр("ru = 'Согласование по документу %1 делегировано %2.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						ТекстСообщения,
						СтрЭтап.ТекущийДокумент,
						ВыбранноеЗначение));
			КонецЕсли;
				
		КонецЦикла;
		// Обновление интерфейса.
		Оповестить("СостояниеЗаявкиПриИзменении");
		Если РазрешеноЗакрытие Тогда
			ЭтаФорма.Модифицированность = Ложь;
		Иначе
			// Не закрываем форму.
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
